//تلخيص الكيوبت اتفرج علي الفيديو من 01.24.00 الي

import 'package:bloc/bloc.dart';

import 'package:bloc/bloc.dart';
import 'package:flutter_bloc/flutter_bloc.dart';
import 'package:login_test/modules/counter/cubit/states.dart';

//الكيبوت ممكن يعمل ستيت واحده بس ف عشان نعمل اكتر من ستيت هنعمل اسكرينه ستيتس ابستراكت كلاس
//ونحطها في اسكرينه الكيوبت عشان نعرف نعمل عدد الستيت اللي عايزنها
//وبعد ما عملنا اتنين استيت هنعمل كونستراكتور وسوبر وده بيحتاج ستيت  من اللي عندك ومش هينفع اديهملو
//ان احط الكونتر ستيت كلها في الكيوبت ف هديهملو بمفهوم كلاس بيير ده واحط في السوبر الستيت الاولي الانيشيال ستيت
//واحط جو الكلاس اللوجيك  الفاريبل والميثود
//عشان انادي كلاس الكونتر كيوبت بسرعه اعمله اوبجكت في نفس الكلاس واديله بلوك بروفيدر دوت اوف كونتيكست
//عشان مينفعش نعمل كونتكست لانه مش عارفها وكمان عشان نفس الكلاس هاخد منه اوبجكت
//ف هعمل ميثود بتاخد جيت اوف كونتكست  بتريتورن الكلاس  وبتاخد بلوك بروفيدر دوت اوف كونتيكي ونعملها ستاتيك  عشان تتنادي دايركت
// فعملنا الميثودعشان نستخدمه في الابليكشن كله
//وبعدين نعمل ميثود عشان ابدء ااغير فيها واعلم ستيت فهعمل فويد مينس وكونتر دوبل مينس وزيه للبلس
//بس عشان تشتغل لازم اناديها علي الستيت ف هعمل ايميت يعني ابعتهاوابعت الميثود اللي عملته في اسكرينه الاستيت
//عشان ابعت قيمه مع كل دوسه هعمل فاريبل في كل كلاس من بلس ومينس وانادي علي الكونستراكتور ب زيس دوت كونتر
//وابعت الكونتر في الايميت
class counterCubit extends Cubit<counterStates> {
  counterCubit() : super(counterInitialState());
  //1.create cubit
//ti be more easily when use this cubit in many place
  static counterCubit get(context) => BlocProvider.of(context);
  int counter = 1;

  void minus() {
    counter--;
    emit(counterMinusState(counter));
  }

  void plus() {
    counter++;
    emit(counterPlusState(counter));
  }
}
